// 1) Доречі, наступним завданням для тебе:
//        TestTirePressure треба переписати так, щоб там використовувались asserts.
//        Подібно до асертів що ми з тобою писали для Man Woman тестів
//
//        Наступні задачі:
//        1) Покрити "Car" клас тестами з testng asserts
//        2) Покрити тестами клас підкачування колес використовуючи testng asserts
//        3) Покрити тестами клас перефарбовування авто використовуючи testng asserts
//
//        додати або переробити існуючи, подивись сам що саме треба зробити. Це задача на те, щоб запам'ятати як писати
//         асерти і підготовка до рефакторингу того, що ти вже написав.
//
//         Переписати клас Car: видалити масив тиску в колесах і замість нього почати використовувати об'єкти класу Wheel для збереження інформації про колеса.
//         Це потягне за собою необхідність переписати метод підкачування колес.
//         Перевірити що ти все правильно написав тобі допоможуть тести з асертами які ти маєш зробити до цього.
// 4) Переписати метод підкачування колес так, щоб він повертав вартість роботи за підкачування.
//         Наприклад, тобі підкачали 4 колеса, підкачування кожного колеса коштує 5, відповідно ти маєш повернути суму = 5 * кількість колес.
//         Написати тест на те, що тобі правильно рахує вартість. З асертом.
// 5) Написати клас "Truck" який наслідує клас "Car". У нього має бути шість колес.
//         Зробити рефакторінг методу підкачування колес: підкачування колес вантажівки коштує *1,5 від підкачування колес для не вантажівки.
//         Написати тест на те, що вартісь підкачування колес для вантажівки рахується вірно
// 6) Наступне
//         Написати клас причепа для перевезення вантажу (інших автомобілів - об'єктів класу Car).
//         Конструктор має мати параметр: кількість авто, що поміщаються на нього.
//         Він має мати методи:
//         - завантажити автомобіль (метод повертає false якщо причеп переповнений і авто яке туди бажають додати вже не поміщається).
//         - Зняти авто: метод повертає останнє авто, яке було завантажене на нього.
//         - count() - повертає кількість авто на причепі.
//         - isFull() - повертає true якщо причеп повний.
//         написати тести на ці методи

//done
// 7) Наступне:        Додати до класу Car інформацію про номерний знак і VIN код.
//         VIN має бути "final".         Номерний знак і VIN код мають задаватись в конструкторі.
// 3)
//         Створити клас Wheel який буде представляти собою абстракцію колеса авто.
//         Цей клас має зберігати інформацію про:
//         - розмір колеса
//         - тип колеса (літня, зимова, всесезонна) (ENUM)
//         - тиск в колесі