package denCars;
////    public class Tasks {
////
////    3. Створити клас який буде імітувати базу авто використовуючи Map "Список автомобілів" з ключем "номер автомобіля" та значенням "автомобіль" (об'єкт класу Car).
////    Реалізувати метод додати автомобіль, видалити, змінити номер авто в базі, перевірити чи номер вже зайнятий.
////
////    після того як зроблена основна частина:
////            3.1 Якщо викликали додавання, або зміну номеру авто, перевіряти чи не існує вже авто з таким номером і якщо існує, викидувати Exception "NumberTakenException".
////
////            4. Створити клас який буде імітувати базу водійських прав використовуючи Set "Список водіїв" зі списком водіїв. Новий клас водія має зберігати усю інформацію з прав.
////            Має бути можливість додати водія, видалити водія, отримати інформацію про водія. Перевірка і видалення мають виконуватися за допомогою номера документа.
//           після того як зроблена основна частина:
//        4.1 Для класа водія реалізувати метод equals(), який буде порівнювати двох водіїв за номером водійських прав. Якщо номера водійських прав, то, відповідно, повертається true.
//        4.2 Розказати мені нащо потрібно реалізовувати equals() для HashSet. :)
////
//        5. в клас Car додати масив який зберігає інформацію про тиск в кожному з колес.
//        Створити новий клас з методом який буде встановлювати потрібний тиск для авто. Параметрами цього методу має бути авто і бажаний тиск.
//        6. В клас Car додай метод перевірки тиску в колесах, чи не спущені колеса (нижче якогось мінімального захардкоженого значення).
//        Якщо хоч одно колесо спущене, він має викидувати Exception з ім'ям "LowTirePressureException".
//
//        7. Видалити з класа Car конструктор без параметрів. Створити новий клас Cars із приватним конструктором. Додати статичний методом getDummyCar()
////        який буде створювати об'єкт класу Car (використовуючу конструктор з параметрами) і повертати його для подальшої роботи з ним в програмі.
//
//        8. Створити новий клас який буде перефарбовувати машину в новий колір. Done
//        Викликати з main метод цього класу передаючи йому авто і бажаний колір.
////}
